/*============================================================================================
 *
 *  (C) 2010, Phyton
 *
 *  Демонстрационный проект для 1986BE91 testboard
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr 1986BE91T1. Компания Phyton
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл systick.h: Утилиты нижнего уровня для работы с системным таймером
 *
 *============================================================================================*/

#ifndef __SYSTICK_H
#define __SYSTICK_H

#include "MDR32Fx.h" 
           
extern uint32_t ticks_per_us;

/* Управление системным таймером */
void SysTickStart(uint32_t ticks);
void SysTickStop(void);

/* Функция задержки (на базе systick) */
void SysTickDelay(uint32_t val);

void StartBeep(uint16_t time);
void StopBeep(void);
void Beep(uint16_t time);
void WaitBeep(void);

#endif /* __SYSTICK_H */

/*============================================================================================
 * Конец файла systick.h
 *============================================================================================*/

